Revit 2024 API
MassSurfaceData.PercentageSkylights Property
 The target percentage of the reference roof surface that is to be covered with automatically generated skylights. Revit will use this number when determining the size, shape, and location of automatically generated skylights.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public double PercentageSkylights { get; set; }
Visual Basic
Public Property PercentageSkylights As Double
	Get
	Set
Visual C++
public:
property double PercentageSkylights {
	double get ();
	void set (double value);
}
Remarks
 The resulting coverage of the roof with skylights is not guaranteed to match this value. It is a target.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: The percentage skylights value is between 0.00 and 0.95.
See Also
MassSurfaceData Class
Autodesk.Revit.DB.Analysis Namespace